lessons/lesson-8-Rails/labreports/app/controllers/labreports_controller.rb

SELECT "labreports".* FROM "labreports"
---
  def index
    @labreports = Labreport.includes(:user).all

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "kristin.kar13@gmail.com"], ["LIMIT", 1]]
INSERT INTO "labreports" ("number_report", "title", "description", "file_name", "grade", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    # Получите значение email из параметров
    email = labreport_params[:email]

    # найти пользователя по email
    user = User.find_by(email: email)

    # Проверьте, был ли найден пользователь
    if user.present?

        labreport_params_ = labreport_params.except(:email)
        labreport_params_[:user_id] = user.id

        # Если пользователь найден, создайте новый отчет с user_id равным id найденного пользователя
        @labreport = Labreport.new(labreport_params_)
        respond_to do |format|
        if @labreport.save

DELETE FROM "labreports" WHERE "labreports"."id" = ?  [["id", 2]]
---
  def destroy
    @labreport.destroy

SELECT "labreports".* FROM "labreports" WHERE "labreports"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_labreport
      @labreport = Labreport.find(params[:id])