lessons/lesson-8-Rails/labreports/app/controllers/labreports_controller.rb

 def mark_update
    param = Labreport.find(params[:id])
    pp(param)
    param.grade = params[:grade]
    param.save
---
SELECT "labreports".* FROM "labreports" WHERE "labreports"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "labreports" SET "grade" = ?, "updated_at" = ? WHERE "labreports"."id" = ?  [["grade", "F"], ["updated_at", "2023-09-19 19:01:16.148196"], ["id", 4]]

  def create

    # Получите значение email из параметров
    email = labreport_params[:email]

    # найти пользователя по email
    user = User.find_by(email: email)

    # Проверьте, был ли найден пользователь
    if user.present?

        labreport_params_ = labreport_params.except(:email)
        labreport_params_[:user_id] = user.id

        # Если пользователь найден, создайте новый отчет с user_id равным id найденного пользователя
        @labreport = Labreport.new(labreport_params_)
        respond_to do |format|
            if @labreport.save
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test@test.ru"], ["LIMIT", 1]]
INSERT INTO "labreports" ("number_report", "title", "description", "file_name", "grade", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

def update
    pp(2)
    # Получите значение email из параметров
    email = labreport_params[:email]

    # найти пользователя по email
    user = User.find_by(email: email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", ""], ["LIMIT", 1]]

  def destroy
    @labreport.destroy
---
DELETE FROM "labreports" WHERE "labreports"."id" = ?  [["id", 15]]

    def set_labreport
      @labreport = Labreport.find(params[:id])
---
SELECT "labreports".* FROM "labreports" WHERE "labreports"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]