lessons/lesson-8-Rails/labreports/app/views/labreports/_labreport.html.erb

    <p>
    <i>User: <%= labreport.user.first_name %> <%= labreport.user.last_name %>  email  <%= labreport.user.email %></i>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]